graph improvement
